/***************************************************************************

     Eeprom读写模块-当在MCU内部直接寻址时(EEPROM或FLASH)的附加函数接口
此接口独立于硬件与应用, 满足及需要此功能时，底层需实现下述函数
注：当使用外部大容量Flash或EEPROM，也可以模拟实现，为此功能以提高效率。
****************************************************************************/

#ifndef _EEPROM_INNER_H
#define _EEPROM_INNER_H
#ifdef SUPPORT_EX_PREINCLUDE//不支持Preinlude時
  #include "Preinclude.h"
#endif

//---------------------------初始化函数---------------------------------
void Eeprom_Init(void);

//----------------------格式化Eeprom数据---------------------------------
void Eeprom_Format(void);

//-----------------------------任务函数---------------------------------
//放入250ms进程中
void Eeprom_Task(void);

//-----------------------得到写入次数函数---------------------------------
//有此功能时将返回，否则返回为0
unsigned long Eeprom_GetWrCount(void);

//----------------------------强制回写缓冲区数据------------------------
//重要数据保存时(如系统实始化标志等)，可调用此函数强制回写
void Eeprom_ForceWrBuf(void);

//-----------------------------强制回写并重启---------------------------
//在检测到关机，或需要复位时需调用此函数防止数据未保存而丢失
void Eeprom_ForceWrBufAndRestart(void);

//-------------------------由Eeprom基址转换为只读指针------------------
//可用于只读数据，建议以结构方式进行以提高效率
const unsigned char *Eeprom_pGetRd(EepromAdr_t Adr, EepromLen_t Len);

//-------------------------由Eeprom基址转换为可写指针------------------
//可用于数据的读写，若只读不更改，应使用Eeprom_pGetRd()以节省写入次数和效率
//建议以结构方式进行以提高效率
unsigned char *Eeprom_pGetWr(EepromAdr_t Adr, EepromLen_t Len);


#endif 
  


