/***************************************************************************

         嵌入式系统通用驱动程序接口及其实现2-EERPOM读写标准化接口

此接口为具体项目的EEPROM读写提供统一接口, 实现了EEPROM硬件与应用的分离。
***************************************************************************/
#ifndef __EEPROM_H
#define __EEPROM_H

/***************************************************************************
                             宏定义部分
***************************************************************************/
//为节省系统资源,将地址位置字长与读写长度进行重定义,此定义建议放到系统全局
//编译宏中(注解掉些宏定义),以实现通用性

//#define EepromAdr_t  unsigned char   //地址空间<255时
#define EepromAdr_t  unsigned short  //地址空间<65535时
//#define EepromAdr_t  unsigned long   //地址空间>65535时

#define EepromLen_t  unsigned char   //一次性读取长度<255时
//#define EepromLen_t  unsigned short  //一次性读取长度<65535时

/***************************************************************************
                          结构与对像声明部分
***************************************************************************/
//(无)


/***************************************************************************
                          对外接口部分
***************************************************************************/

//-----------------------------初始化函数---------------------------------
void Eeprom_Init(void);

//---------------------------读取Eeprom数据---------------------------------
void Eeprom_Rd(EepromAdr_t Adr,   //Eerpom中的存取位置
               void *pVoid,       //读回数据的起始位置
               EepromLen_t Len);  //读取长度

//---------------------------写入Eeprom数据---------------------------------
void Eeprom_Wr(EepromAdr_t Adr,   //Eerpom中的存取位置
               const void *pVoid, //被写数据的起始位置
               EepromLen_t Len);  //写入长度

//--------------------------Eeprom写常量数据--------------------------
//此函数为附加功能, 部分驱动实现
void Eeprom_WrConst(EepromAdr_t Adr,   //Eerpom中的存取位置
                  unsigned char Data,  //常量数据
                  EepromLen_t Len);    //写入长度

/***************************************************************************
                    静态回调函数声明(或直接宏实现)部分
***************************************************************************/
//(无)

#endif //#define __EEPROM_H



