/***************************************************************************

         嵌入式系统通用驱动程序接口及其实现2-EERPOM存取位置标准化接口

此接口为具体项目: 所有存取位置的,提供统一接口。实现了调用层与移动应用的分离。
***************************************************************************/
#ifndef __INFO_BASE_H 
#define __INFO_BASE_H 


//---------------------------得到成员偏移函数-------------------------------
#define struct_offset(type, member) ((unsigned int)(&(((type *)0)->member))) 


//------------------------------地址空间分配-------------------------------
//下列代码与具体应用有关，接需修改:
#ifdef SUPPORT_项目名称_硬件版本号(可选)         //大写
  #include "InfoBase_项目名称硬件版本号(可选).h"  //小写
#endif 

#ifdef SUPPORT_项目名称n_硬件版本号m(可选)         //大写
  #include "InfoBase_项目名称n硬件版本号(可选)m.h"  //小写
#endif 



#endif //#define __INFO_BASE_H 

